Reports/ур_ОтчетОНаличииСортовыхСемянБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ур_ОтчетОНаличииСортовыхСемянБУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Началопериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ур_ВариантыВыводаОтчетовПоУчетуЗерна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Типовой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Типовой</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Типовой</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ур_КлассыПосевныхСтандартов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ур_КлассыПосевныхСтандартов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервыйКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВторойКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретийКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ур_ВариантыВыводаОтчетовПоУчетуЗерна.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ур_ВариантыВыводаОтчетовПоУчетуЗерна</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>килограммы</Name>
					<Comment>в килограммах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>тонны</Name>
					<Comment>в тоннах</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ур_Репродукция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ур_Репродукция</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Элита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Третья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четвертая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ур_КатегорииСеменныхРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ур_КатегорииСеменныхРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяКатегория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяКатегория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяКатегория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ур_ОтчетОНаличииСортовыхСемянБУ/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	//КомпоновщикНастроек.Восстановить();
	//НастройкаКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(Период) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Период", КонецДня(Период));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Период", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Функция ПолучитьВыборку()
	
	запрос = Новый Запрос;
	
	Запрос.Текст  =
	"ВЫБРАТЬ
	|	ТиповойОстатки.Организация,
	|	ТиповойОстатки.Субконто2 КАК Склад,
	|	ТиповойОстатки.Субконто2.Область КАК Область,
	|	ТиповойОстатки.Субконто3 КАК ЗерноваяРасписка,
	|	ТиповойОстатки.Субконто3.СортСеменногоРесурса КАК Сорт,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КлассПосевногоСтандарта = ЗНАЧЕНИЕ(Перечисление.ур_КлассыПосевныхСтандартов.ПервыйКласс)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКлассПосевногоСтандартаПервыйКласс,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КлассПосевногоСтандарта = ЗНАЧЕНИЕ(Перечисление.ур_КлассыПосевныхСтандартов.ВторойКласс)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКлассПосевногоСтандартаВторойКласс,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КлассПосевногоСтандарта = ЗНАЧЕНИЕ(Перечисление.ур_КлассыПосевныхСтандартов.ТретийКласс)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКлассПосевногоСтандартаТретийКласс,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.Репродукция = ЗНАЧЕНИЕ(Перечисление.ур_Репродукция.Элита)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокРепродукцияЭлита,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.Репродукция = ЗНАЧЕНИЕ(Перечисление.ур_Репродукция.Первая)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокРепродукцияПервая,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.Репродукция = ЗНАЧЕНИЕ(Перечисление.ур_Репродукция.Вторая)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокРепродукцияВторая,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.Репродукция = ЗНАЧЕНИЕ(Перечисление.ур_Репродукция.Третья)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокРепродукцияТретья,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.Репродукция = ЗНАЧЕНИЕ(Перечисление.ур_Репродукция.Четвертая)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокРепродукцияЧетвертая,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КатегорияСеменногоРесурса = ЗНАЧЕНИЕ(Перечисление.ур_КатегорииСеменныхРесурсов.ПерваяКатегория)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКатегорияСеменногоРесурсаПервая,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КатегорияСеменногоРесурса = ЗНАЧЕНИЕ(Перечисление.ур_КатегорииСеменныхРесурсов.ВтораяКатегория)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКатегорияСеменногоРесурсаВторая,
	|	ВЫБОР
	|		КОГДА ТиповойОстатки.Субконто3.КатегорияСеменногоРесурса = ЗНАЧЕНИЕ(Перечисление.ур_КатегорииСеменныхРесурсов.ТретьяКатегория)
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|						ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|					ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКатегорияСеменногоРесурсаТретья,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ур_ВариантыВыводаОтчетовПоУчетуЗерна.килограммы)
	|			ТОГДА ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0) * 1000
	|		ИНАЧЕ ЕСТЬNULL(ТиповойОстатки.КоличествоОстатокДТ, 0)
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ТиповойОстатки.СуммаОстатокДТ КАК СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Типовой.Остатки(&Период, Счет в (&СчетОтбора), &СписокВидовСубконто, Субконто1.Зерно) КАК ТиповойОстатки
	|";
	
	СписокВидовСубконто = Новый Массив;
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура);
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Склады);
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Партии);
	
	мСписокНоменклатурныхСчетов = Новый СписокЗначений();
		
	Запрос.УстановитьПараметр("СчетОтбора",мСписокНоменклатурныхСчетов);
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмеренияОтчета);
	Запрос.УстановитьПараметр("СписокВидовСубконто",СписокВидовСубконто);
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = "Отчет о наличии сортовых семян " + " на " + Формат(Период, "ДФ=dd.MM.yyyy")+" ("+ЕдиницаИзмеренияОтчета+")";

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
